# Haoran Yang
## week 14 04 / 23 /2021
### Python - Pandas DtaFrame - Grouping and Mapping

In [9]:
import numpy as np

from pandas import Series, DataFrame
import pandas as pd

In [10]:
# mapping
df = DataFrame({'city':['Alma','Brian Head','Fox Park','Lake Mary'],
               'altitude':[10355,9800,9062,8966]})

df

         city  altitude
0        Alma     10355
1  Brian Head      9800
2    Fox Park      9062
3   Lake Mary      8966

In [3]:
st_map = {'Alma':'Colorado','Brain Head':'Utah','Fox Park':'Wyoming','Lake Mary':'California'}

st_map

{'Alma': 'Colorado',
 'Brain Head': 'Utah',
 'Fox Park': 'Wyoming',
 'Lake Mary': 'California'}

In [4]:
df['state'] = df['city'].map(st_map)

df

         city  altitude       state
0        Alma     10355    Colorado
1  Brian Head      9800         NaN
2    Fox Park      9062     Wyoming
3   Lake Mary      8966  California

In [5]:
# apply 
def meter(x):
    return x / 3.2808

In [6]:
df['altitude'] = df['altitude'].apply(meter)


df

         city     altitude       state
0        Alma  3156.242380    Colorado
1  Brian Head  2987.076323         NaN
2    Fox Park  2762.131188     Wyoming
3   Lake Mary  2732.870032  California

In [11]:
df = DataFrame(np.random.randn(4,3),columns = list ('bed'),
              index = ['UT','OH','TX','OR'])

df

           b         e         d
UT -0.307408 -1.308980 -0.293234
OH  2.240655 -0.314643  1.558050
TX  0.244171 -0.602652  1.114068
OR  0.258300 -0.185658 -0.026111

In [12]:
def dif(x):
    return x.max() - x.min()

In [13]:
df.apply(dif)

b    2.548063
e    1.123322
d    1.851284
dtype: float64

In [14]:
# groupby
df = DataFrame({'k1': ['a','a','b','b','c'],
               'k1':['one','two','one','two','one'],
               'dataset1':np.random.randn(5),
               'dataset2':np.random.randn(5)})

df

    k1  dataset1  dataset2
0  one -0.277978  1.028034
1  two  0.819499 -0.472578
2  one  0.729582  0.865368
3  two  0.448336  0.935058
4  one -0.446619 -1.187538

In [15]:
df.groupby('k1').count()

     dataset1  dataset2
k1
one         3         3
two         2         2

In [16]:
df.groupby('k1').size()

k1
one    3
two    2
dtype: int64

In [17]:
df.groupby(['k1','k2']).count()

KeyError: 'k2'

In [18]:
df.groupby('k1').mean()

     dataset1  dataset2
k1
one  0.001662  0.235288
two  0.633918  0.231240

In [19]:
df

    k1  dataset1  dataset2
0  one -0.277978  1.028034
1  two  0.819499 -0.472578
2  one  0.729582  0.865368
3  two  0.448336  0.935058
4  one -0.446619 -1.187538

In [20]:
df['dataset1'].groupby(df['k1']).mean()

k1
one    0.001662
two    0.633918
Name: dataset1, dtype: float64